# SelectedElementsArePartOfOtherSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..SelectedElementsArePartOfOtherSystem Property
BuiltInFailures..::..SystemsFailures Class See Also
---
You have selected elements that are already part of other System. They will be removed from the original Systems and added to this one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SelectedElementsArePartOfOtherSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SelectedElementsArePartOfOtherSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SelectedElementsArePartOfOtherSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace